<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Lego Mindstorms for Education
    </string>
    <key>Identifier</key>
    <string>com.github.joncohen.download.legomindstorms</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://le-www-live-s.legocdn.com/downloads/LME-EV3/LME-EV3_Full-setup_1.3.2_en-GB_OSX.dmg</string>
                <key>filename</key>
                <string>LegoMindstorm-Edu.dmg</string>
            </dict>
        </dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>   
            <key>Processor</key>   
            <string>CodeSignatureVerifier</string>   
            <key>Arguments</key>   
            <dict>   
               <key>input_path</key>   
               <string>%pathname%/LEGO*.*pkg</string>
               <key>expected_authority_names</key>
               <array>
                  <string>Developer ID Installer: National Instruments (SKTKK2QZ74)</string>
                  <string>Developer ID Certification Authority</string>
                  <string>Apple Root CA</string>
               </array>
            </dict>
         </dict>
    </array>
</dict>
</plist>